Repository: jrevillard/edulift-mobile
Catalog: lib/l10n/app_*.arb
Languages: fr

# removeMemberWarningMessage
source: This member will lose access to all family data. This action cannot be undone.
fr: Ce membre perdra l'accès à toutes les données familiales. Cette action est irréversible.

# memberActionsFor
source: Member actions for {memberName}
fr: Actions pour {memberName}

source: Leave Group
fr: Quitter le Groupe

# leaveGroupTitle
source: Leave Group
fr: Quitter le Groupe

# byLeavingGroupYouWill
source: By leaving this group, you will:
fr: En quittant ce groupe, vous allez :

# loseAccessGroupSchedules
source: Lose access to all group schedules
fr: • Perdre l'accès à tous les horaires du groupe

# noLongerSeeGroupMembers
source: No longer see group families and members
fr: • Ne plus voir les familles et membres du groupe

source: Give up group admin privileges
fr: • Abandonner les privilèges d'administrateur du groupe

# ownerFamilyCannotLeave
source: Note: The owner family cannot leave the group. Only members can leave.
fr: Note : La famille propriétaire ne peut pas quitter le groupe. Seuls les membres peuvent partir.

# failedToLeaveGroup
source: Failed to leave group: {error}
fr: Échec de la sortie du groupe : {error}

# linkExpiryInfo
source: The link expires in 15 minutes for your security.
fr: Le lien expire dans 15 minutes pour votre sécurité.

source: Loading...
fr: Chargement...

source: Loading error
fr: Erreur de chargement

# loadingErrorText
source: Loading error
fr: Erreur de chargement

source: Loading invitations...
fr: Chargement des invitations...

source: Loading sent invitations...
fr: Chargement des invitations envoyées...

source: Loading statistics...
fr: Chargement des statistiques...

source: Loading vehicles...
fr: Chargement des véhicules...

source: Log Export
fr: Export des logs

source: Log Level
fr: Niveau de log

# logLevelChangeFailed
source: Failed to change log level: {error}
fr: Échec du changement de niveau de log : {error}

# logLevelChanged
source: Log level changed to: {level}
fr: Niveau de log changé en : {level}

# logLevelDescription
source: Controls verbosity of app logging for debugging
fr: Contrôle la verbosité de la journalisation pour le débogage

# logout
source: Sign Out
fr: Se déconnecter

# logsExportedSuccess
source: Logs exported and uploaded to Firebase successfully!
fr: 📤 Logs exportés et envoyés à Firebase avec succès !

# logExportUnsupportedPlatform
source: Log export is only supported on mobile platforms (Android/iOS)
fr: L'export des logs n'est supporté que sur mobile (Android/iOS)

# logExportNoDirectory
source: No export directory found
fr: Aucun répertoire d'export trouvé

# logExportNoFiles
source: No log files found after export
fr: Aucun fichier de log trouvé après l'export

# loseAccessSchedules
source: Lose access to all family schedules
fr: • Perdre l'accès à tous les horaires familiaux

# loseAccessVehicles
source: Lose access to family vehicles and assignments
fr: • Perdre l'accès aux véhicules familiaux et aux affectations

# magicLinkExpired
source: Magic link has expired. Please request a new one.
fr: Le lien magique a expiré. Veuillez en demander un nouveau.

# magicLinkResent
source: Login link resent
fr: Lien de connexion renvoyé

# magicLinkSent
source: Magic link sent to your email
fr: Lien magique envoyé à votre e-mail

# magicLinkSentDescription
source: A secure login link has been sent to:
fr: Un lien de connexion sécurisé a été envoyé à :

# magicLinkSentTitle
source: Login link sent
fr: Lien de connexion envoyé

source: Make Admin
fr: Nommer administrateur

# makeAdminConfirmation
source: Grant admin privileges to {name}?
fr: Accorder les privilèges d'admin à {name} ?

source: Manage
fr: Gérer

source: Manage Family
fr: Gérer la Famille

# maxSeatsLabel
source: Max: {max}
fr: Maximum: {max} sièges

source: Max Vehicles
fr: Véhicules Max

# maximumTimeSlotsAllowed
source: Maximum {count} time slots allowed
fr: Maximum {count} créneaux horaires autorisés

source: Member
fr: Membre

source: Member Actions
fr: Actions Membre

# memberCount
source: {count, plural, =1{1 member} other{{count} members}}
fr: {count, plural, =1{1 membre} other{{count} membres}}

source: Member Details
fr: Détails du Membre

# memberRemovedFromFamily
source: {memberName} removed from family
fr: {memberName} retiré(e) de la famille

# memberRole
source: MEMBER
fr: MEMBRE

source: members
fr: membres

# membersTabLabel
source: Members
fr: Membres

# minSeatsLabel
source: Min: {min}
fr: Minimum: {min} sièges

# minimumIntervalRequired
source: Minimum {minutes} minutes required between time slots
fr: Minimum {minutes} minutes requis entre les créneaux

# minutesAgo
source: {count}min ago
fr: il y a {count}min

# modifiedFrom
source: modified from {original}
fr: Modifié de {original}

source: Mon
fr: Lun

source: Monday
fr: Lundi

# mondayShort
source: Mon
fr: Lun

# mondayToFridayShort
source: Mon - Fri
fr: Lun - Ven

# monthView
source: Month
fr: Mois

source: Month view implementation
fr: Implémentation vue mois

source: More actions for
fr: Plus d'actions pour

source: Morning
fr: Matin

# monthLabel
source: Month
fr: Mois

source: My family
fr: Ma famille

source: Name
fr: Nom

# nameMaxLength
source: Name cannot exceed 50 characters
fr: Le nom ne peut pas dépasser 50 caractères

# nameMinLength
source: Name must contain at least 2 characters
fr: Le nom doit contenir au moins 2 caractères

source: Name (optional)
fr: Nom (optionnel)

# navigationDashboard
source: Dashboard
fr: Tableau de bord

# navigationFamily
source: Family
fr: Famille

# navigationGroups
source: Groups
fr: Groupes

# navigationProfile
source: Profile
fr: Profil

# navigationSchedule
source: Schedule
fr: Planning

# needGroupForSchedules
source: You need to join or create a transport group to view schedules.
fr: Vous devez rejoindre ou créer un groupe de transport pour voir les plannings.

source: New Admin Email
fr: Email du nouvel admin

source: New child
fr: Nouvel enfant

source: New Family Invitation
fr: Nouvelle invitation familiale

# newInvitationUpdate
source: New invitation update received
fr: Nouvelle mise à jour d'invitation reçue

source: Next Week
fr: Semaine suivante

source: Current Week
fr: Semaine actuelle

source: Last Week
fr: Semaine dernière

# inWeeks
source: {count, plural, =1{In {count} week} other{In {count} weeks}}
fr: {count, plural, =1{Dans {count} semaine} other{Dans {count} semaines}}

source: No children
fr: Aucun enfant

source: No children assigned
fr: Aucun enfant assigné

# vehiclesPlural
source: {count, plural, =1{{count} vehicle} other{{count} vehicles}}
fr: {count, plural, =1{{count} véhicule} other{{count} véhicules}}

source: Unknown Vehicle
fr: Véhicule inconnu

# moreItems
source: +{count} more
fr: +{count} de plus

source: No days configured
fr: Aucun jour configuré

source: No departure times selected
fr: Aucune heure de départ sélectionnée

# noExpiryDate
source: No expiry (single use)
fr: Aucune expiration (usage unique)

source: No Expiry Issues
fr: Aucun problème d'expiration

source: No family
fr: Aucune famille

source: No family found
fr: Aucune famille trouvée

source: No family ID available
fr: Aucun ID de famille disponible

# noFilteredInvitations
source: No {filterType} invitations
fr: Aucune invitation {filterType}

source: No invitation codes
fr: Aucun code d'invitation

# noInvitationCodesMessage
source: Generate invitation codes to facilitate joining.
fr: Générez des codes d'invitation pour faciliter l'adhésion.

source: No invitations
fr: Aucune invitation

# noInvitationsMessage
source: You have no pending invitations. New invitations will appear here.
fr: Vous n'avez aucune invitation en attente. Les nouvelles invitations apparaîtront ici.

source: No invitations yet
fr: Aucune invitation pour le moment

# noLongerSeeFamilyMembers
source: No longer see family members and children
fr: • Ne plus voir les membres de la famille et les enfants

source: No pending invitations
fr: Aucune invitation en attente

source: No recent activity
fr: Aucune activité récente

source: No sent invitations
fr: Aucune invitation envoyée

# noSentInvitationsMessage
source: Invite members to your family or groups to get started.
fr: Invitez des membres dans votre famille ou vos groupes pour commencer.

# noScheduleConfigured
source: No schedule configured for this day
fr: Aucun horaire configuré pour ce jour

source: No time slots configured
fr: Aucun créneau horaire configuré

source: No Transport Groups
fr: Aucun Groupe de Transport

# noTransportGroupsDescription
source: Create or join a transport group to coordinate school trips with other families.
fr: Créez ou rejoignez un groupe de transport pour coordonner les trajets scolaires avec d'autres familles.

source: No vehicles
fr: Aucun véhicule

source: None
fr: Aucun

source: Optional description
fr: Description optionnelle

source: Override capacity
fr: Capacité personnalisée

# overrideCapacityDisplay
source: Override: {count}
fr: Ajustement : {count}

source: Override History
fr: Historique des Ajustements

source: Override Type
fr: Type d'Ajustement

source: Paste from clipboard
fr: Coller depuis le presse-papiers

source: Pending
fr: En attente

source: Pending Invitations
fr: Invitations en attente

# pendingInvitationsStats
source: Pending
fr: En attente

source: Personal information
fr: Informations personnelles

# pleaseEnterNewAdminEmail
source: Please enter an email for the new admin
fr: Veuillez entrer un email pour le nouvel admin

# pleaseEnterValidNumber
source: Please enter a valid number
fr: Veuillez entrer un nombre valide

source: Previous Week
fr: Semaine précédente

source: Privacy
fr: Confidentialité

source: Processing...
fr: Traitement en cours...

source: Profile
fr: Profil

source: Promote Another Admin
fr: Promouvoir un autre admin

# promoteAnotherAdminDesc
source: Choose a family member to promote to admin role
fr: Choisir un membre de la famille à promouvoir au rôle d'admin

source: Promote to Admin
fr: Promouvoir en Administrateur

source: Quick Configurations
fr: Configurations rapides

# realTimeUpdatesUnavailable
source: Real-time updates unavailable. Tap refresh to load latest invitations.
fr: Mises à jour en temps réel indisponibles. Appuyez sur actualiser pour charger les dernières invitations.

source: Reason
fr: Raison

source: Received
fr: Reçues

source: Recent activity
fr: Activité récente

source: Refresh
fr: Actualiser

source: Rejected
fr: Refusées

# rejectedInvitations
source: Rejected
fr: Refusées

source: Remove Admin
fr: Retirer Admin

# removeAdminConfirmation
source: Remove admin privileges from {name}?
fr: Retirer les privilèges d'admin à {name} ?

# removeAdminNote
source: Note: This member will lose admin privileges
fr: Note: Ce membre perdra les privilèges d'administrateur

source: Remove Member
fr: Retirer le membre

# removeMemberConfirmation
source: Are you sure you want to remove {memberName} from the family?
fr: Êtes-vous sûr de vouloir retirer {memberName} de la famille?

# removeMemberDialogAccessibilityLabel
source: Remove Member Confirmation Dialog
fr: Dialogue de confirmation de retrait de membre

# removeMemberFromFamily
source: Remove member from this family
fr: Retirer le membre de cette famille

source: Remove this invitation
fr: Supprimer cette invitation

# removeYourselfFromFamily
source: Remove yourself from this family
fr: Vous retirer de cette famille

source: Resend
fr: Renvoyer

source: Resend link
fr: Renvoyer le lien

source: Reset
fr: Réinitialiser

source: Retry
fr: Réessayer

source: Retry Export
fr: Réessayer l'export

source: Revoke
fr: Révoquer

source: Revoked
fr: Révoquées

source: Reconnect
fr: Reconnecter

source: Resolve
fr: Résoudre

source: Role
fr: Rôle

# roleLabel
source: Role: {role}
fr: Rôle : {role}

# roleUpdatedSuccessfully
source: Role updated successfully for {name}
fr: Rôle mis à jour avec succès pour {name}

source: Sat
fr: Sam

source: Saturday
fr: Samedi

# saturdayShort
source: Sat
fr: Sam

# saturdayToSundayShort
source: Sat - Sun
fr: Sam - Dim

source: Save
fr: Enregistrer

source: Saved
fr: Enregistré

source: Saving...
fr: Enregistrement...

source: Schedule
fr: Planning

# scheduleLabel
source: Schedule
fr: Calendrier

source: Schedule Configuration
fr: Configuration du Planning

source: Schedule configuration updated successfully
fr: Configuration horaire mise à jour avec succès

source: Schedule Coordination
fr: Coordination d'Horaire

# scheduleCount
source: {count, plural, =1{{count} schedule} other{{count} schedules}}
fr: {count, plural, =1{{count} horaire} other{{count} horaires}}

source: Schedule Preview
fr: Aperçu du Planning

source: Schedule refreshed
fr: Horaire actualisé

source: School
fr: École

source: School name
fr: Nom de l'école

source: Search
fr: Rechercher

source: Search invitations...
fr: Rechercher les invitations...

source: Seat Capacity Management
fr: Gestion de la Capacité des Sièges

source: Seating Configuration
fr: Configuration des sièges

source: seats
fr: places

# secureLogin
source: Secure magic link login
fr: Connexion sécurisée par lien magique

# seeMemberInformation
source: See member information and activity
fr: Voir les informations et l'activité du membre

source: Select
fr: Sélectionner

source: Select Another Group
fr: Sélectionner un autre groupe

# selectGroup
source: Select a Group
fr: Sélectionner un groupe

# selectLanguage
source: Select your preferred language
fr: Sélectionnez votre langue préférée

source: Select Member to Promote
fr: Sélectionner le membre à promouvoir

source: Select New Admin
fr: Sélectionner le nouvel admin

source: Send Invitation
fr: Envoyer l'Invitation

# sendInvitationTooltip
source: Send invitation
fr: Envoyer une invitation

source: Send Magic Link
fr: Envoyer le lien magique

# sendingButton
source: Sending...
fr: Envoi...

source: Sent
fr: Envoyées

# serverError
source: Server error. Please try again later
fr: Erreur serveur. Veuillez réessayer plus tard

source: Settings
fr: Paramètres

source: Show Invitation Code
fr: Afficher le Code d'Invitation

source: Show Vehicles
fr: Afficher les véhicules

# signInToJoin
source: Sign In to Join {familyName}
fr: Se connecter pour rejoindre {familyName}

source: Sign In to Join {familyName}
fr: Se connecter pour rejoindre {familyName}

source: Sign In to Join {groupName}
fr: Se connecter pour rejoindre {groupName}

# slotsConfigured
source: {current}/{max} slots configured {active} active
fr: {current}/{max} créneaux configurés • {active} actifs

# slotsCount
source: {count, plural, =1{{count} slot} other{{count} slots}}
fr: {count, plural, =1{{count} créneau} other{{count} créneaux}}

source: Stack Trace
fr: Trace de la pile

source: Statistics
fr: Statistiques

# statusAccepted
source: ACCEPTED
fr: ACCEPTÉ

# statusActive
source: Active
fr: Actif

# statusCancelled
source: CANCELLED
fr: ANNULÉ

# statusDeclined
source: DECLINED
fr: REFUSÉ

# statusExpired
source: EXPIRED
fr: EXPIRÉ

# statusExpiringSoon
source: EXPIRING SOON
fr: EXPIRE BIENTÔT

# statusFailed
source: FAILED
fr: ÉCHOUÉ

# statusInvalid
source: INVALID
fr: INVALIDE

# statusPending
source: PENDING
fr: EN ATTENTE

# statusRevoked
source: REVOKED
fr: RÉVOQUÉ

source: Stay
fr: Rester

# stayButton
source: Stay
fr: Rester

source: Stay in Current Family
fr: Rester dans la famille actuelle

# stayInCurrentFamilyDesc
source: Decline the new invitation and remain in your current family
fr: Refuser la nouvelle invitation et rester dans votre famille actuelle

source: Successfully joined group\!
fr: Groupe rejoint avec succès \!

source: Sun
fr: Dim

source: Sunday
fr: Dimanche

# sundayShort
source: Sun
fr: Dim

source: Switch to New Family
fr: Changer pour la nouvelle famille

# switchToNewFamilyDesc
source: Leave your current family and join the new one
fr: Quitter votre famille actuelle et rejoindre la nouvelle

source: Tap to add first time slot
fr: Appuyer pour ajouter le premier créneau horaire

source: Temporary
fr: Temporaire

source: Thu
fr: Jeu

source: Thursday
fr: Jeudi

# thursdayShort
source: Thu
fr: Jeu

source: Time
fr: Heure

# timeAgoDays
source: {days} day{plural} ago
fr: Il y a {days} jour{plural}

# timeAgoHours
source: {hours} hour{plural} ago
fr: Il y a {hours} heure{plural}

# timeAgoMinutes
source: {minutes} minute{plural} ago
fr: Il y a {minutes} minute{plural}

# timeAlreadySelected
source: Time {time} is already selected
fr: L'heure {time} est déjà sélectionnée

# timeIntervalError
source: Time must be in 15-minute intervals (00, 15, 30, 45)
fr: L'heure doit être par intervalles de 15 min (00, 15, 30, 45)

# timeLabel
source: Time (HH:MM)
fr: Heure (HH:MM)

# timePickerInstructions
source: Select departure times by tapping on the time slots
fr: Sélectionnez les heures de départ en appuyant sur les créneaux horaires

# timeRange
source: Time range: {range}
fr: Plage horaire : {range}

# timeSlotExists
source: This time slot already exists
fr: Ce créneau horaire existe déjà

source: Time Slots
fr: Créneaux Horaires

# timeSlotsSelected
source: {count, plural, =0{No time slots selected} =1{{count} time slot selected} other{{count} time slots selected}}
fr: {count, plural, =0{Aucun créneau horaire sélectionné} =1{{count} créneau horaire sélectionné} other{{count} créneaux horaires sélectionnés}}

source: Today
fr: Aujourd'hui

# totalChildrenCount
source: {count, plural, =0{No children} =1{1 child} other{{count} children}}
fr: {count, plural, =0{Aucun enfant} =1{1 enfant} other{{count} enfants}}

# totalMembersCount
source: {count, plural, =0{No members} =1{1 member} other{{count} members}}
fr: {count, plural, =0{Aucun membre} =1{1 membre} other{{count} membres}}

# totalVehiclesCount
source: {count, plural, =0{No vehicles} =1{1 vehicle} other{{count} vehicles}}
fr: {count, plural, =0{Aucun véhicule} =1{1 véhicule} other{{count} véhicules}}

source: Total capacity
fr: Capacité totale

# totalSeatsHint
source: Number of child seats available
fr: Nombre total de sièges

source: Transfer Ownership
fr: Transférer la propriété

# transferOwnershipDesc
source: Transfer full ownership of the family to another member
fr: Transférer la propriété complète de la famille à un autre membre

# transferOwnershipWarning
source: This will transfer full ownership and admin rights to the selected member. This action cannot be undone.
fr: Ceci transférera la propriété complète et les droits d'admin au membre sélectionné. Cette action est irréversible.

source: Transport Groups
fr: Groupes de Transport

source: Trip creation form to implement
fr: Formulaire de création de trajet à implémenter

source: Try Again
fr: Réessayer

source: Tue
fr: Mar

source: Tuesday
fr: Mardi

# tuesdayShort
source: Tue
fr: Mar

# typeToConfirm
source: Type '{confirmText}' to confirm:
fr: Tapez '{confirmText}' pour confirmer :

source: Universal invitation
fr: Invitation universelle

source: Unknown Family
fr: Famille inconnue

source: Unsaved Changes
fr: Modifications non enregistrées

# unsavedChangesTitle
source: Unsaved Changes
fr: Modifications non enregistrées

source: Update Vehicle
fr: Modifier le véhicule

source: Updating
fr: Mise à jour

source: Usage
fr: Utilisation

source: User Menu
fr: Menu Utilisateur

# userProfileOptions
source: User profile options would appear here
fr: Les options du profil utilisateur apparaîtraient ici

# userRole
source: Role: {role}
fr: Rôle : {role}

source: Validate Code
fr: Valider le code

source: Validating group invitation...
fr: Validation de l'invitation de groupe...

source: Validating invitation...
fr: Validation de l'invitation...

source: Van
fr: Fourgonnette

source: Vehicle added successfully
fr: Véhicule ajouté avec succès

# vehicleAssignment
source: Vehicle Assignment: {vehicleId}
fr: Affectation de Véhicule : {vehicleId}

# vehicleCount
source: {count, plural, =1{{count} vehicle} other{{count} vehicles}}
fr: {count, plural, =1{{count} véhicule} other{{count} véhicules}}

source: Vehicle details
fr: Détails du véhicule

source: Vehicle ID
fr: ID du véhicule

source: Vehicle Information
fr: Informations du véhicule

source: Vehicle Name
fr: Nom du véhicule

# vehicleNameRequired
source: Vehicle name *
fr: Nom du véhicule *

source: Vehicle not found
fr: Véhicule non trouvé

source: Vehicle type
fr: Type de véhicule

source: Vehicle updated successfully
fr: Véhicule mis à jour avec succès

source: Vehicles
fr: Véhicules

# vehicleAddedSuccess
source: {vehicleName} added successfully
fr: {vehicleName} ajouté avec succès

# vehicleFailedToAdd
source: Failed to add vehicle: {error}
fr: Échec de l'ajout du véhicule : {error}

# vehicleAlreadyAssigned
source: {vehicleName} is already assigned to this slot
fr: {vehicleName} est déjà assigné à ce créneau

# vehicleFailedToRemove
source: Failed to remove vehicle: {error}
fr: Échec de la suppression du véhicule : {error}

# vehicleRemovedSuccess
source: {vehicleName} removed successfully
fr: {vehicleName} supprimé avec succès

# verificationFailedTitle
source: Verification failed
fr: Vérification échouée

source: View
fr: Voir

source: View All
fr: Voir tout

source: View details
fr: Voir les détails

source: View Group Schedule
fr: Voir l'horaire du groupe

source: View Member Details
fr: Voir les détails du membre

source: Wed
fr: Mer

source: Wednesday
fr: Mercredi

# wednesdayShort
source: Wed
fr: Mer

# weekLabel
source: Week
fr: Semaine

# weekView
source: Week
fr: Semaine

source: Week view implementation
fr: Implémentation vue semaine

# weekdaysCount
source: {count, plural, =1{{count} weekday} other{{count} weekdays}}
fr: {count, plural, =1{{count} jour de semaine} other{{count} jours de semaine}}

source: Weekdays Only
fr: Jours de semaine uniquement

# weekendDaysCount
source: {count, plural, =1{{count} weekend day} other{{count} weekend days}}
fr: {count, plural, =1{{count} jour de week-end} other{{count} jours de week-end}}

source: Weekends Only
fr: Week-end uniquement

source: Weekly Schedule
fr: Planning hebdomadaire

# weeklySlotTotal
source: {count, plural, =1{{count} slot per week} other{{count} slots per week}}
fr: {count, plural, =1{{count} créneau par semaine} other{{count} créneaux par semaine}}

# welcomeNewUser
source: Welcome! We see you're new. Please provide your name to complete your account.
fr: Bienvenue ! Nous voyons que vous êtes nouveau. Veuillez renseigner votre nom pour finaliser votre compte.

# welcomeToEduLiftLogin
source: Welcome to EduLift
fr: Bienvenue sur EduLift

# whyOverrideNeeded
source: Why is this override needed?
fr: Pourquoi cet ajustement est-il nécessaire ?

source: Yesterday
fr: Hier

source: You
fr: Vous

# youAreLastAdmin
source: You are the last admin
fr: Vous êtes le dernier admin

# youAreLeavingAs
source: You are leaving as: {role}
fr: Vous quittez en tant que : {role}

# youHaveLeftFamily
source: You have left the family
fr: Vous avez quitté la famille

source: You've been invited to join
fr: Vous avez été invité(e) à rejoindre

# validGroupInvitation
source: This group invitation is valid and ready to use.
fr: Cette invitation de groupe est valide et prête à être utilisée.

source: Verifying Magic Link
fr: Vérification du Lien Magique

# verifyingMagicLinkMessage
source: Please wait while we verify your magic link...
fr: Veuillez patienter pendant que nous vérifions votre lien magique...

source: Verification Successful
fr: Vérification Réussie

# welcomeAfterMagicLinkSuccess
source: Welcome to EduLift! Taking you to your dashboard...
fr: Bienvenue sur EduLift ! Redirection vers votre tableau de bord...

source: Secure Authentication
fr: Authentification Sécurisée

source: Cancel Changes
fr: Annuler les Modifications

source: Save Configuration
fr: Enregistrer la Configuration

source: Quick selection options
fr: Options de sélection rapide

source: Active Schedule Days
fr: Jours d'Horaire Actifs
