Repository: jrevillard/edulift-mobile
Catalog: lib/l10n/app_*.arb
Languages: fr

source: About
fr: À propos

source: Accept
fr: Accepter

source: Accepted
fr: Acceptées

# acceptedInvitations
source: Accepted
fr: Acceptées

# actionCannotBeUndone
source: This action cannot be undone
fr: Cette action ne peut pas être annulée

# actionCheckConnection
source: Check your internet connection
fr: Vérifiez votre connexion internet

# actionCheckEmail
source: Check your email for a new login link
fr: Vérifiez votre e-mail pour un nouveau lien de connexion

# actionFillRequired
source: Make sure all required fields are filled
fr: Assurez-vous que tous les champs obligatoires sont remplis

# actionRestartApp
source: Restart the app if the problem continues
fr: Redémarrez l'application si le problème persiste

# actionReviewInfo
source: Review the information you entered
fr: Vérifiez les informations que vous avez saisies

# actionSignOutSignIn
source: Sign out and sign in again
fr: Déconnectez-vous et reconnectez-vous

# actionSwitchNetwork
source: Switch to mobile data if using WiFi
fr: Basculez vers les données mobiles si vous utilisez le WiFi

# actionTryAgain
source: Try again
fr: Réessayez

source: Active
fr: Actifs

source: Active Days
fr: Jours Actifs

source: Active Override
fr: Ajustement Actif

source: Add
fr: Ajouter

source: Add child
fr: Ajouter un enfant

source: Add Event
fr: Ajouter événement

source: Add First Time Slot
fr: Ajouter le Premier Créneau

# addFirstVehicle
source: Add your first vehicle to start\norganizing trips.
fr: Ajoutez votre premier véhicule pour commencer\nà organiser les trajets.

source: Add or remove vehicles
fr: Ajouter ou supprimer des véhicules

source: Add Override
fr: Ajouter Ajustement

source: Add Slot
fr: Ajouter Créneau

source: Add Time Slot
fr: Ajouter un Créneau

# addTimeSlotsDescription
source: Add time slots to define when vehicles can be scheduled
fr: Ajoutez des créneaux pour définir quand les véhicules peuvent être programmés

source: Add vehicle
fr: Ajouter un véhicule

# addVehicleTitle
source: Add Vehicle
fr: Ajouter un véhicule

# addVehicleToSlot
source: Add Vehicle
fr: Ajouter un véhicule

# addVehiclesToFamilyToStartScheduling
source: Add vehicles to your family to start scheduling
fr: Ajoutez des véhicules à votre famille pour commencer la planification

# additionalInformation
source: Any additional information...
fr: Toute information supplémentaire...

# additionalNavigationOptions
source: Additional navigation options would appear here
fr: Des options de navigation supplémentaires apparaîtraient ici

source: Additional Notes (Optional)
fr: Notes Supplémentaires (Optionnel)

source: Adjust Capacity
fr: Ajuster la capacité

source: Adjusted Capacity
fr: Capacité ajustée

# adjustmentReason
source: Reason for adjustment (optional)
fr: Raison de l'ajustement

# adjustmentReasonHint
source: e.g., car seat, maintenance
fr: Ex: siège enfant, équipement...

# adminCanManageMembers
source: Admin can manage family members
fr: L'admin peut gérer les membres de la famille

source: Administrator
fr: Administrateur

source: Afternoon
fr: Après-midi

# age
source: Age: {years} years
fr: Âge: {years} ans

source: All
fr: Tout

source: All Days
fr: Tous les jours

# allDaysSubtitle
source: Every day
fr: Chaque jour

source: Apply Changes
fr: Appliquer les modifications

# assignChildrenButton
source: Assign {count, plural, =1{{count} Child} other{{count} Children}}
fr: Assigner {count, plural, =1{{count} Enfant} other{{count} Enfants}}

source: Assign children to vehicles
fr: Assigner des enfants aux véhicules

source: Assign New Admin and Switch
fr: Assigner un nouvel admin et changer

# assignNewAdminDesc
source: Promote another member to admin, then join the new family
fr: Promouvoir un autre membre en admin, puis rejoindre la nouvelle famille

# assignVehicleToSlot
source: Assign a vehicle to this time slot
fr: Assigner un véhicule à ce créneau

# assignedChildren
source: Assigned Child
fr: Enfant assigné

source: Available Options
fr: Options disponibles

source: Available seats
fr: Places disponibles

source: Back to home
fr: Retour à l'accueil

source: Back to login
fr: Retour à la connexion

source: Basic information
fr: Informations de base

source: Biometric authentication
fr: Authentification biométrique

# byLeavingFamilyYouWill
source: By leaving this family, you will:
fr: En quittant cette famille, vous allez :

source: Cancel
fr: Annuler

source: Cancel Invitation
fr: Annuler l'Invitation

# cancelInvitationMessage
source: They will no longer be able to join your family using this invitation.
fr: Ils ne pourront plus rejoindre votre famille avec cette invitation.

# cancelInvitationTitle
source: Cancel Invitation
fr: Annuler l'Invitation

source: Cancelled
fr: Annulées

source: Capacity
fr: Capacité

# capacityAdjustmentHint
source: Temporarily adjust the number of available seats.
fr: Vous pouvez ajuster temporairement la capacité

# capacityAndReasonRequired
source: Capacity and reason are required
fr: La capacité et la raison sont requises

# capacityExceeded
source: Capacity exceeded by {count}
fr: Capacité dépassée de {count}

# capacityHelpText
source: Number of child seats available (do not include driver)
fr: Inclure le siège conducteur dans le nombre total

source: Capacity Information
fr: Informations de capacité

source: Car
fr: Voiture

# checkBackLater
source: Check back later for new invitations
fr: Revenez plus tard pour de nouvelles invitations

source: Check your email
fr: Vérifiez votre email

source: Checking user...
fr: Vérification de l'utilisateur...

# childAddedSuccessfully
source: Child "{childName}" added successfully
fr: Enfant "{childName}" ajouté avec succès

# childDetailsTitle
source: Child Details
fr: Détails de l'enfant

# childIdLabel
source: Child ID: {childId}
fr: ID Enfant : {childId}

# childInfoDescription
source: Add your child's information to include them in family management.
fr: Ajoutez les informations de votre enfant pour l'inclure dans la gestion familiale.

# childNameHint
source: First or last name
fr: Prénom ou nom de famille

# childAgeOptional
source: Age (optional)
fr: Âge (facultatif)

# enterChildAge
source: Enter age
fr: Saisir l'âge

# childTransportCapacity
source: {count, plural, =0{This vehicle cannot transport children} =1{This vehicle can transport up to {count} child} other{This vehicle can transport up to {count} children}}
fr: {count, plural, =0{Ce véhicule ne peut pas transporter d'enfants (siège conducteur exclu)} =1{Ce véhicule peut transporter jusqu'à {count} enfant (siège conducteur exclu)} other{Ce véhicule peut transporter jusqu'à {count} enfants (siège conducteur exclu)}}

source: Child updated successfully
fr: Enfant mis à jour avec succès

source: Children
fr: Enfants

# childrenAssigned
source: {count, plural, =1{{count} child assigned successfully} other{{count} children assigned successfully}}
fr: {count, plural, =1{{count} enfant assigné avec succès} other{{count} enfants assignés avec succès}}

# childrenCount
source: {count, plural, =1{{count} child} other{{count} children}}
fr: {count, plural, =1{{count} enfant} other{{count} enfants}}

# childrenSelected
source: {count, plural, =1{{count} child selected} other{{count} children selected}}
fr: {count, plural, =1{{count} enfant sélectionné} other{{count} enfants sélectionnés}}

# chooseGroupForSchedule
source: Choose a transport group to view its weekly schedule
fr: Choisissez un groupe de transport pour voir son planning hebdomadaire

source: Choose Resolution
fr: Choisir une résolution

source: Clear all
fr: Tout effacer

source: Clear filters
fr: Effacer les filtres

source: Close
fr: Fermer

source: Code copied to clipboard
fr: Code copié dans le presse-papiers

# codeExpired
source: This code has expired
fr: Ce code a expiré

source: Code for {email}:
fr: Code pour {email} :

source: Code joining
fr: Adhésion par code

source: Coming soon
fr: Bientôt disponible

source: Common departure times
fr: Heures de départ courantes

source: Configure Schedule
fr: Configurer le planning

source: Configure Time Slots
fr: Configurer les Créneaux

source: Configure {weekday} schedule
fr: Configurer l'horaire du {weekday}

source: Confirm
fr: Confirmer

# confirmDelete
source: Are you sure you want to delete
fr: Êtes-vous sûr de vouloir supprimer

# confirmLogout
source: Confirm Sign Out
fr: Confirmer la déconnexion

# confirmLogoutMessage
source: Are you sure you want to sign out?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# confirmVehicleDeletion
source: Are you sure you want to delete "{vehicleName}"? This action is irreversible and will also delete all assignments for this vehicle.
fr: Êtes-vous sûr de vouloir supprimer "{vehicleName}" ?\n\nCette action est irréversible et supprimera également\ntoutes les assignations de ce véhicule.

source: Conflict Resolution
fr: Résolution de conflit

# conflictResolutionComingSoon
source: Conflict resolution feature coming soon
fr: Fonctionnalité de résolution de conflit bientôt disponible

# continueButton
source: Continue
fr: Continuer

source: Copy Code
fr: Copier le Code

source: Create account
fr: Créer le compte

source: Create Family
fr: Créer une famille

source: Create Group
fr: Créer un Groupe

source: Create New Group
fr: Créer un Nouveau Groupe

source: Create Override
fr: Créer Ajustement

# createOverrideError
source: Failed to create override. Please try again.
fr: Échec de la création du remplacement. Veuillez réessayer.

source: Create Seat Override
fr: Créer un Ajustement de Siège

# createTransportGroupDescription
source: Create a transport group to coordinate with other families
fr: Créez un groupe de transport pour coordonner avec d'autres familles

source: Create Trip
fr: Créer un trajet

source: Create Vehicle
fr: Créer le véhicule

source: Create Your Family
fr: Créer votre famille

source: Created
fr: Créé

# createdOn
source: Created on {date}
fr: Créée le {date}

source: Creating...
fr: Création...

source: Dashboard
fr: Tableau de bord

# criticalExpiringCount
source: {count, plural, =1{{count} expiring in 2 hours or less} other{{count} expiring in 2 hours or less}}
fr: {count, plural, =1{{count} expire dans 2 heures ou moins} other{{count} expirent dans 2 heures ou moins}}

# currentCapacity
source: Current: {count} {count, plural, =1{seat} other{seats}}
fr: Actuel : {count} {count, plural, =0{siège} =1{siège} other{sièges}}

# currentFamily
source: Current family: {familyName}
fr: Famille actuelle : {familyName}

# currentSeatsLabel
source: Current: {count} seats
fr: Actuel: {count} sièges

source: Current Situation
fr: Situation actuelle

source: Custom time
fr: Heure personnalisée

# daysAgo
source: {count, plural, =0{Today} =1{Yesterday} other{{count}d ago}}
fr: {count, plural, =0{Aujourd'hui} =1{Hier} other{Il y a {count} jours}}

# daysCount
source: {count, plural, =1{{count} day} other{{count} days}}
fr: {count, plural, =1{{count} jour} other{{count} jours}}

source: Decline
fr: Refuser

# defaultCapacity
source: Default: {count} {count, plural, =1{seat} other{seats}}
fr: Par défaut : {count} {count, plural, =0{siège} =1{siège} other{sièges}}

source: Delete
fr: Supprimer

source: Delete Assignment
fr: Supprimer l'affectation

# deleteAssignmentTooltip
source: Delete Assignment
fr: Supprimer l'Affectation

source: Delete Family
fr: Supprimer la famille

source: Delete Family and Switch
fr: Supprimer la famille et changer

# deleteFamilyConfirmation
source: Delete Family
fr: Supprimer la famille

# deleteFamilyDesc
source: Permanently delete your current family and join the new one
fr: Supprimer définitivement votre famille actuelle et rejoindre la nouvelle

# deleteFamilyLastMemberDesc
source: Permanently delete this family since you are the only member
fr: Supprimer définitivement cette famille car vous êtes le seul membre

# deleteFamilyWarning
source: This will permanently delete the family '{familyName}' and all its data. This action cannot be undone.
fr: Ceci supprimera définitivement la famille '{familyName}' et toutes ses données. Cette action est irréversible.

# deleteTimeSlotTooltip
source: Delete time slot
fr: Supprimer le créneau

source: Delete vehicle
fr: Supprimer le véhicule

source: Demote from Admin
fr: Rétrograder de l'administration

# departureTimesSelected
source: {count, plural, =1{{count} departure time selected} other{{count} departure times selected}}
fr: {count, plural, =1{{count} heure de départ sélectionnée} other{{count} heures de départ sélectionnées}}

source: Departure Hours
fr: Heures de Départ

source: Developer Tools
fr: Outils de développement

# displayInvitationCode
source: Display the invitation code
fr: Afficher le code d'invitation

source: Drag vehicles to time slots
fr: Glissez les véhicules vers les créneaux horaires

source: Edit
fr: Modifier

source: Edit Assignment
fr: Modifier l'affectation

# editAssignmentTooltip
source: Edit Assignment
fr: Modifier l'Affectation

source: Edit functionality coming soon
fr: Fonctionnalité de modification bientôt disponible

source: Edit Group
fr: Modifier le groupe

source: Edit Time Slot
fr: Modifier le Créneau

# editTimeSlotTooltip
source: Edit time slot
fr: Modifier le créneau

source: Edit Vehicle
fr: Modifier le véhicule

# editVehicleTitle
source: Edit Vehicle
fr: Modifier le véhicule

# editVehicleTooltip
source: Edit Vehicle
fr: Modifier le véhicule

source: Email address
fr: Adresse email

# emailRequired
source: Email is required
fr: L'e-mail est requis

source: Emergency
fr: Urgence

source: Emergency contact
fr: Contact d'urgence

source: English
fr: Anglais

# ensureOtherAdmins
source: As an admin, ensure there are other admins in the family before leaving.
fr: En tant qu'administrateur, assurez-vous qu'il y a d'autres administrateurs dans la famille avant de partir.

# enterEmailOfFamilyMember
source: Enter email of a family member
fr: Entrez l'email d'un membre de la famille

# enterFamilyInvitationInstruction
source: Please enter your family invitation code to continue
fr: Veuillez entrer votre code d'invitation familiale pour continuer

# enterFullName
source: Enter your full name
fr: Saisissez votre nom complet

# enterGroupInvitationCodeTitle
source: Enter Group Invitation Code
fr: Entrer le code d'invitation de groupe

# enterGroupInvitationInstruction
source: Please enter your group invitation code to continue
fr: Veuillez entrer votre code d'invitation de groupe pour continuer

source: Enter group name
fr: Saisir le nom du groupe

source: Enter invitation code
fr: Saisir le code d'invitation

# enterInvitationCodeTitle
source: Enter Invitation Code
fr: Entrer le code d'invitation

# enterMemberEmail
source: Enter member's email
fr: Entrez l'email du membre

# enterMemberName
source: Enter member's name
fr: Entrez le nom du membre

source: Enter new capacity
fr: Entrez la nouvelle capacité

source: Enter received code
fr: Entrez le code reçu

source: Enter total seats
fr: Saisir le nombre total de sièges

source: Enter vehicle name
fr: Entrez le nom du véhicule

# errorAuth
source: Authentication error
fr: Erreur d'authentification

# errorAuthAccessDenied
source: Access denied
fr: Accès refusé

# errorAuthAccountDisabled
source: This account has been disabled. Please contact support
fr: Ce compte a été désactivé. Veuillez contacter le support

# errorAuthAccountLocked
source: This account has been locked due to suspicious activity
fr: Ce compte a été verrouillé en raison d'une activité suspecte

# errorAuthAccountNotFound
source: No account found with this email address
fr: Aucun compte trouvé avec cette adresse e-mail

# errorAuthApiError
source: API error. Please try again
fr: Erreur API. Veuillez réessayer

# errorAuthBiometricAuthFailed
source: Biometric authentication failed. Please try again
fr: L'authentification biométrique a échoué. Veuillez réessayer

# errorAuthBiometricLockout
source: Biometric authentication is temporarily locked. Please try again later
fr: L'authentification biométrique est temporairement verrouillée. Veuillez réessayer plus tard

# errorAuthBiometricNotAvailable
source: Biometric authentication is not available on this device
fr: L'authentification biométrique n'est pas disponible sur cet appareil

# errorAuthBiometricNotEnabled
source: Biometric authentication is not enabled
fr: L'authentification biométrique n'est pas activée

# errorAuthBiometricNotEnrolled
source: No biometric data enrolled. Please set up biometric authentication in your device settings
fr: Aucune donnée biométrique enregistrée. Veuillez configurer l'authentification biométrique dans les paramètres de votre appareil

# errorAuthConfigurationError
source: Authentication configuration error. Please contact support
fr: Erreur de configuration de l'authentification. Veuillez contacter le support

# errorAuthConnectionLost
source: Connection lost. Please check your internet connection
fr: Connexion perdue. Veuillez vérifier votre connexion Internet

# errorAuthCrossUserTokenAttempt
source: Invalid token for this user
fr: Jeton invalide pour cet utilisateur

# errorAuthDecryptionError
source: Failed to decrypt authentication data
fr: Échec du déchiffrement des données d'authentification

# errorAuthDeviceNotRecognized
source: Device not recognized. Please verify your identity
fr: Appareil non reconnu. Veuillez vérifier votre identité

# errorAuthEmailAlreadyExists
source: An account with this email already exists
fr: Un compte avec cette adresse e-mail existe déjà

# errorAuthEmailInvalid
source: Please enter a valid email address
fr: Veuillez saisir une adresse e-mail valide

# errorAuthEmailNotVerified
source: Email address has not been verified
fr: L'adresse e-mail n'a pas été vérifiée

# errorAuthEmailRequired
source: Email address is required
fr: L'adresse e-mail est requise

# errorAuthEmailTooLong
source: Email address is too long (maximum 254 characters)
fr: L'adresse e-mail est trop longue (maximum 254 caractères)

# errorAuthEncryptionError
source: Failed to encrypt authentication data
fr: Échec du chiffrement des données d'authentification

# errorAuthInsufficientPermissions
source: You don't have permission to perform this action
fr: Vous n'avez pas la permission d'effectuer cette action

# errorAuthInvalidCredentials
source: Invalid email or password
fr: E-mail ou mot de passe invalide

# errorAuthInvalidEmail
source: Email address format is invalid
fr: Le format de l'adresse e-mail est invalide

# errorAuthInvalidMagicLink
source: This magic link is invalid or has already been used
fr: Ce lien magique est invalide ou a déjà été utilisé

# errorAuthInvalidRequest
source: Invalid request. Please try again
fr: Requête invalide. Veuillez réessayer

# errorAuthInvalidToken
source: Authentication token is invalid
fr: Le jeton d'authentification est invalide

# errorAuthInvalidVerificationCode
source: Invalid verification code
fr: Code de vérification invalide

# errorAuthInviteCodeExpired
source: This invitation code has expired
fr: Ce code d'invitation a expiré

# errorAuthInviteCodeInvalid
source: Please enter a valid invitation code (at least 6 characters)
fr: Veuillez saisir un code d'invitation valide (au moins 6 caractères)

# errorAuthIpBlocked
source: Access temporarily blocked. Please try again later
fr: Accès temporairement bloqué. Veuillez réessayer plus tard

# errorAuthMagicLinkAlreadyUsed
source: This magic link has already been used
fr: Ce lien magique a déjà été utilisé

# errorAuthMagicLinkExpired
source: This magic link has expired. Please request a new one
fr: Ce lien magique a expiré. Veuillez en demander un nouveau

# errorAuthMagicLinkTokenInvalid
source: The magic link token is invalid or has expired
fr: Le jeton du lien magique est invalide ou a expiré

# errorAuthMagicLinkTokenRequired
source: Magic link token is required
fr: Le jeton du lien magique est requis

# errorAuthMessage
source: Your session has expired. Please sign in again.
fr: Votre session a expiré. Veuillez vous reconnecter.

# errorAuthMultipleSessions
source: Multiple sessions detected. Please sign in again
fr: Plusieurs sessions détectées. Veuillez vous reconnecter

# errorAuthNameInvalidChars
source: Name can only contain letters, spaces, hyphens, and apostrophes
fr: Le nom ne peut contenir que des lettres, espaces, traits d'union et apostrophes

# errorAuthNameMaxLength
source: Name cannot exceed 50 characters
fr: Le nom ne peut pas dépasser 50 caractères

# errorAuthNameMinLength
source: Name must be at least 2 characters
fr: Le nom doit contenir au moins 2 caractères

# errorAuthNameRequired
source: Full name is required
fr: Le nom complet est requis

# errorAuthNetworkError
source: Network error. Please check your internet connection
fr: Erreur réseau. Veuillez vérifier votre connexion Internet

# errorAuthOperationCancelled
source: Operation cancelled
fr: Opération annulée

# errorAuthPkceVerificationFailed
source: Authentication verification failed
fr: La vérification de l'authentification a échoué

# errorAuthResourceNotFound
source: The requested resource was not found
fr: La ressource demandée n'a pas été trouvée

# errorAuthSecureStorageUnavailable
source: Secure storage is not available on this device
fr: Le stockage sécurisé n'est pas disponible sur cet appareil

# errorAuthSecurityValidationFailed
source: Security validation failed. Please try again
fr: La validation de sécurité a échoué. Veuillez réessayer

# errorAuthServerError
source: Server error. Please try again later
fr: Erreur serveur. Veuillez réessayer plus tard

# errorAuthSessionExpired
source: Your session has expired. Please sign in again
fr: Votre session a expiré. Veuillez vous reconnecter

# errorAuthStorageError
source: Failed to save authentication data. Please try again
fr: Échec de la sauvegarde des données d'authentification. Veuillez réessayer

# errorAuthSuspiciousActivity
source: Suspicious activity detected. Please verify your identity
fr: Activité suspecte détectée. Veuillez vérifier votre identité

# errorAuthTimeout
source: Request timed out. Please try again
fr: Délai d'attente dépassé. Veuillez réessayer

# errorAuthTitle
source: Authentication Required
fr: Authentification Requise

# errorAuthTokenExpired
source: Your session has expired. Please sign in again
fr: Votre session a expiré. Veuillez vous reconnecter

# errorAuthTokenMissing
source: Authentication token is missing
fr: Le jeton d'authentification est manquant

# errorAuthTokenRefreshFailed
source: Failed to refresh authentication. Please sign in again
fr: Échec du rafraîchissement de l'authentification. Veuillez vous reconnecter

# errorAuthTokenStorageError
source: Failed to store authentication token
fr: Échec du stockage du jeton d'authentification

# errorAuthTooManyAttempts
source: Too many failed attempts. Please try again later
fr: Trop de tentatives échouées. Veuillez réessayer plus tard

# errorAuthUnknown
source: An unexpected error occurred. Please try again
fr: Une erreur inattendue s'est produite. Veuillez réessayer

# errorAuthUserAlreadyInFamily
source: This user is already member of another family
fr: Cet utilisateur est déjà membre d'une autre famille

# errorAuthUserDataStorageError
source: Failed to store user data
fr: Échec du stockage des données utilisateur

# errorAuthorizationMessage
source: You don't have permission to perform this action.
fr: Vous n'avez pas la permission d'effectuer cette action.

# errorAuthorizationTitle
source: Access Denied
fr: Accès Refusé

# errorBiometricMessage
source: Biometric authentication failed. Please try again or use your passcode.
fr: L'authentification biométrique a échoué. Veuillez réessayer ou utiliser votre code d'accès.

# errorBiometricTitle
source: Biometric Error
fr: Erreur Biométrique

source: Error changing language
fr: Erreur lors du changement de langue
