Repository: jrevillard/edulift-mobile
Catalog: lib/l10n/app_*.arb
Languages: fr

# seatOverrideUpdateFailed
source: Failed to update seat override: {error}
fr: Échec de la mise à jour du remplacement de siège : {error}

# saveAssignments
source: Save ({count})
fr: Enregistrer ({count})

# vehicleCapacityFull
source: Cannot assign child: vehicle full
fr: Impossible d'assigner l'enfant : véhicule plein

source: Assignments saved successfully
fr: Assignations enregistrées avec succès

# selectWeekHelpText
source: Select week
fr: Sélectionner la semaine

# weekPickerHelperText
source: Select any date to jump to that week
fr: Sélectionnez une date pour aller à cette semaine

# vehiclesAssigned
source: {count, plural, =0{No vehicles} =1{1 vehicle} other{{count} vehicles}}
fr: {count, plural, =0{Aucun véhicule} =1{1 véhicule} other{{count} véhicules}}

source: No vehicles assigned
fr: Aucun véhicule assigné

source: Collapse {timeSlot}
fr: Replier {timeSlot}

# cannotAddVehiclesToPastSlots
source: Cannot add vehicles to past time slots
fr: Impossible d'ajouter des véhicules aux créneaux passés

# vehicleNotFoundInFamily
source: The vehicle "{vehicleName}" (ID: {vehicleId}) is assigned to this time slot but no longer exists in your family.
fr: Le véhicule "{vehicleName}" (ID: {vehicleId}) est assigné à ce créneau mais n'existe plus dans votre famille.

# contactSupportOrRemoveAssignment
source: Please contact support or remove this assignment.
fr: Veuillez contacter le support ou supprimer cette assignment.

source: Remove Assignment
fr: Supprimer l'assignment

source: Times shown in your timezone
fr: Horaires affichés dans votre fuseau horaire

# timezoneLabel
source: Timezone
fr: Fuseau horaire

# timesShownInTimezone
source: Times shown in your timezone ({timezone})
fr: Horaires affichés dans votre fuseau horaire ({timezone})

# todayTransports
source: Today's Transports
fr: Transports d'aujourd'hui

# noTransportsToday
source: No transports scheduled today
fr: Aucun transport prévu aujourd'hui

source: See full schedule
fr: Voir le planning complet →

# refreshFailed
source: Failed to refresh transport data
fr: Échec du rafraîchissement des données de transport

# loadingTodayTransports
source: Loading today's transports...
fr: Chargement des transports d'aujourd'hui...

source: Error loading transports
fr: Erreur de chargement des transports

# todayTransportList
source: Today's transport list
fr: Liste des transports d'aujourd'hui

source: Next 7 days
fr: Prochains 7 jours

source: Week view expanded
fr: Vue semaine étendue

# noTransportsWeek
source: No transports this week
fr: Aucun transport cette semaine

source: Expand week view
fr: Étendre la vue semaine

source: Collapse week view
fr: Réduire la vue semaine

# scheduleSlotError
source: Unable to complete this operation. The schedule slot may not exist or there may be a connection issue.
fr: Impossible de compléter cette opération. Le créneau horaire n'existe peut-être pas ou il peut y avoir un problème de connexion.

# permissionError
source: You don't have permission to perform this action.
fr: Vous n'avez pas la permission d'effectuer cette action.

# vehicleNotFoundError
source: The selected vehicle could not be found. Please try again.
fr: Le véhicule sélectionné n'a pas pu être trouvé. Veuillez réessayer.
