Repository: jrevillard/edulift-mobile
Catalog: lib/l10n/app_*.arb
Languages: fr

# daysSelected
source: {count}/7 days selected
fr: {count}/7 jours sélectionnés

# atLeastOneDayRequired
source: At least one day must be selected
fr: Au moins un jour doit être sélectionné

# noDaysSelectedWarning
source: No days selected. Schedule will be disabled.
fr: Aucun jour sélectionné. L'horaire sera désactivé.

source: Schedule Active
fr: Horaire Actif

# weekdayAbbrevMon
source: Mon
fr: Lun

# weekdayAbbrevTue
source: Tue
fr: Mar

# weekdayAbbrevWed
source: Wed
fr: Mer

# weekdayAbbrevThu
source: Thu
fr: Jeu

# weekdayAbbrevFri
source: Fri
fr: Ven

# weekdayAbbrevSat
source: Sat
fr: Sam

# weekdayAbbrevSun
source: Sun
fr: Dim

# weekendLabel
source: Weekend
fr: Fin de semaine

source: Enter email address
fr: Entrez l'adresse e-mail

# pleaseEnterValidEmail
source: Please enter a valid email
fr: Veuillez entrer une adresse e-mail valide

source: Invitation sent successfully
fr: Invitation envoyée avec succès

# addChildButton
source: Add Child
fr: Ajouter un Enfant

source: Save Vehicle
fr: Enregistrer le Véhicule

source: Select Time Slot
fr: Sélectionner un Créneau

source: Confirm Schedule
fr: Confirmer l'Horaire

source: Schedule confirmed
fr: Horaire confirmé

source: Schedule Details
fr: Détails de l'Horaire

source: Edit Schedule
fr: Modifier l'Horaire

# welcomeOnboarding
source: Welcome
fr: Bienvenue

source: Get Started
fr: Commencer

# skipOnboarding
source: Skip
fr: Passer

# nextOnboarding
source: Next
fr: Suivant

# nameRequired
source: Name is required
fr: Le nom est requis

# dashboardTitle
source: Dashboard
fr: Tableau de Bord

# createFamilyButton
source: Create Family
fr: Créer une Famille

# familyNameLabel
source: Family Name
fr: Nom de Famille

# scheduleConfigSavedSuccess
source: Schedule configuration saved successfully
fr: Configuration de l'emploi du temps enregistrée avec succès

# scheduleConfigSaveFailed
source: Failed to save configuration: {error}
fr: Échec de l'enregistrement de la configuration : {error}

# saveOperationFailed
source: Save operation did not complete successfully
fr: L'opération d'enregistrement ne s'est pas terminée avec succès

# scheduleConfigSaveException
source: Failed to save configuration: {error}
fr: Échec de l'enregistrement de la configuration : {exception}

# changesCanceledReverted
source: Changes canceled - reverted to original configuration
fr: Modifications annulées - retour à la configuration d'origine

# unsavedChangesScheduleMessage
source: You have unsaved changes to the schedule configuration. Are you sure you want to leave without saving?
fr: Vous avez des modifications non enregistrées dans la configuration de l'emploi du temps. Êtes-vous sûr de vouloir quitter sans enregistrer ?

# groupNotFoundOrNoAccess
source: The group could not be found or you no longer have access to it.
fr: Le groupe est introuvable ou vous n'y avez plus accès.

source: Failed to load group details
fr: Échec du chargement des détails du groupe

# yourNameLabel
source: Your Name
fr: Votre nom

# enterFullNameHint
source: Enter your full name
fr: Entrez votre nom complet

# personalMessageOptionalLabel
source: Personal Message (Optional)
fr: Message personnel (facultatif)

# addPersonalMessageHint
source: Add a personal message to your invitation...
fr: Ajoutez un message personnel à votre invitation...

# ageOptionalLabel
source: Age (optional)
fr: Âge (facultatif)

# enterAgeHint
source: Enter age
fr: Entrez l'âge

# yearsUnit
source: years
fr: ans

# enterFamilyNameHint
source: Enter family name (e.g., Smith Family)
fr: Entrez le nom de famille (ex : Famille Dupont)

# describeFamilyOptionalHint
source: Describe your family (optional)
fr: Décrivez votre famille (facultatif)

# familyInvitationCodeHint
source: Family invitation code
fr: Code d'invitation familiale

# enterEmailAddressHint
source: Enter your email address
fr: Entrez votre adresse e-mail

# nameTooShort
source: Name must be at least 2 characters
fr: Le nom doit contenir au moins 2 caractères

source: Family name cannot be empty
fr: Le nom de famille ne peut pas être vide

# familyNameTooShortValidation
source: Family name must be at least 2 characters
fr: Le nom de famille doit contenir au moins 2 caractères

# defaultGroupConfigInfo
source: Configure departure hours for each day and save to activate the schedule.
fr: Aucun emploi du temps configuré. Configurez les heures de départ pour chaque jour et enregistrez pour activer l'emploi du temps.

# makeAdminTitle
source: Make Admin
fr: Promouvoir administrateur

# removeAdminRoleTitle
source: Remove Admin Role
fr: Retirer le rôle d'administrateur

# makeAdminButton
source: Make Admin
fr: Promouvoir administrateur

# removeAdminButton
source: Remove Admin
fr: Retirer administrateur

# addChildAction
source: Add Child
fr: Ajouter un enfant

# joinGroupAction
source: Join a Group
fr: Rejoindre un groupe

# addVehicleAction
source: Add Vehicle
fr: Ajouter un véhicule

# configureScheduleTooltip
source: Configure Schedule
fr: Configurer l'emploi du temps

# removeVehicleTooltip
source: Remove Vehicle
fr: Retirer le véhicule

# editTimeTooltip
source: Edit time
fr: Modifier l'heure

# deleteTimeTooltip
source: Delete time
fr: Supprimer l'heure

# resolveScheduleConflictsTooltip
source: Resolve schedule conflicts
fr: Résoudre les conflits d'emploi du temps

# refreshScheduleTooltip
source: Refresh schedule
fr: Actualiser l'emploi du temps

# filterAndSortOptionsTooltip
source: Filter and sort options
fr: Options de filtrage et de tri

# logoutTooltip
source: Logout
fr: Déconnexion

# tryLoadingConfigAgainLabel
source: Try loading configuration again
fr: Réessayer de charger la configuration

# switchToDayConfigurationLabel
source: Switch to {day} configuration
fr: Basculer vers la configuration de {day}

# departureHoursConfiguredHint
source: {count} departure hours configured
fr: {count} heures de départ configurées

# noDepartureHoursConfiguredHint
source: No departure hours configured
fr: Aucune heure de départ configurée

# viewScheduleConflictsLabel
source: View schedule conflicts
fr: Voir les conflits d'emploi du temps

# refreshScheduleLabel
source: Refresh schedule
fr: Actualiser l'emploi du temps

# filterScheduleLabel
source: Filter schedule
fr: Filtrer l'emploi du temps

# eventAtTimeLabel
source: {eventTitle} at {time}
fr: {eventTitle} à {time}

# familyNameInputFieldLabel
source: Family name input field
fr: Champ de saisie du nom de famille

# familyDescriptionInputFieldLabel
source: Family description input field
fr: Champ de saisie de la description de la famille

# createFamilyButtonLabel
source: Create family button
fr: Bouton créer une famille

# cancelButtonLabel
source: Cancel button
fr: Bouton annuler

source: Remove Vehicle
fr: Retirer le véhicule

source: Edit time
fr: Modifier l'heure

source: Delete time
fr: Supprimer l'heure

source: Resolve schedule conflicts
fr: Résoudre les conflits d'horaire

source: Refresh schedule
fr: Actualiser l'emploi du temps

source: Filter and sort options
fr: Options de filtrage et de tri

# joinedDate
source: Joined
fr: Inscrit

source: Enter age
fr: Entrez l'âge

source: Enter your email address
fr: Entrez votre adresse e-mail

source: Biometric authentication button
fr: Bouton d'authentification biométrique

source: WebSocket connection status
fr: État de la connexion WebSocket

source: Welcome Section
fr: Section de bienvenue

source: Current date and dashboard description
fr: Date actuelle et description du tableau de bord

source: Family Overview Section
fr: Section d'aperçu familial

source: Welcome icon
fr: Icône de bienvenue

source: Family icon
fr: Icône de famille

source: Loading family information
fr: Chargement des informations familiales

source: Error loading family information
fr: Erreur lors du chargement des informations familiales

source: Error icon
fr: Icône d'erreur

source: Quick Actions Section
fr: Section des actions rapides

source: Recent Activities Section
fr: Section des activités récentes

source: No recent activity icon
fr: Icône d'absence d'activité récente

source: Upcoming Trips Section
fr: Section des trajets à venir

source: No trips scheduled icon
fr: Icône d'absence de trajets planifiés

# unexpectedErrorOccurred
source: An unexpected error occurred.
fr: Une erreur inattendue s'est produite.

# failedToSendMagicLink
source: Failed to send magic link - empty response
fr: Échec de l'envoi du lien magique - réponse vide

source: Vehicle Near Capacity
fr: Véhicule près de la capacité maximale

source: Family Invitation Expired
fr: Invitation familiale expirée

source: Group Membership Updated
fr: Adhésion au groupe mise à jour

source: Data Refresh
fr: Actualisation des données

source: View conflict details
fr: Voir les détails du conflit

source: Attempting to reconnect...
fr: Tentative de reconnexion...

# realtimeUpdatesActive
source: Real-time updates are active
fr: Les mises à jour en temps réel sont actives

source: Connecting to real-time updates...
fr: Connexion aux mises à jour en temps réel...

source: Synchronizing data...
fr: Synchronisation des données...

# userAvatarFor
source: User avatar for {userName}
fr: Avatar de l'utilisateur pour {userName}

# welcomeBackUser
source: Welcome back, {userName}!
fr: Bonjour, {userName} !

# currentDateAndDashboardDesc
source: Current date and dashboard description
fr: Date actuelle et description du tableau de bord

# yourTransportDashboard
source: Your transport dashboard {date}
fr: Votre tableau de bord transport • {date}

# familyStatistics
source: Family statistics: {members} members, {children} children, {vehicles} vehicles
fr: Statistiques familiales : {members} membres, {children} enfants, {vehicles} véhicules

source: Register for transport
fr: Inscription au transport

source: Connect with other families
fr: Connectez-vous avec d'autres familles

source: Offer rides to others
fr: Proposer des trajets aux autres

source: Logged in as
fr: Connecté en tant que

# toGetStartedSetupFamily
source: To get started, you need to set up your family.
fr: Pour commencer, vous devez configurer votre famille.

# settingUpOnboarding
source: Setting up your onboarding...
fr: Configuration de votre intégration...

# youveBeenInvitedToJoinFamily
source: You've been invited to join a family!
fr: Vous avez été invité à rejoindre une famille !

# acceptInvitationToCoordinate
source: Accept the invitation to start coordinating with other families.
fr: Acceptez l'invitation pour commencer à coordonner avec d'autres familles.

source: Choose Your Family Setup
fr: Choisissez votre configuration familiale

source: Join Existing Family
fr: Rejoindre une famille existante

# groupMembersPageTitle
source: {groupName} - Members
fr: {groupName} - Membres

# promoteToAdminConfirm
source: Are you sure you want to promote "{familyName}" to Administrator? They will be able to manage group members and settings.
fr: Êtes-vous sûr de vouloir promouvoir "{familyName}" en Administrateur ? Ils pourront gérer les membres et les paramètres du groupe.

source: Promote
fr: Promouvoir

# familyPromotedSuccess
source: Family promoted to Admin successfully
fr: Famille promue en Administrateur avec succès

source: Failed to promote family
fr: Échec de la promotion de la famille

source: Demote to Member
fr: Rétrograder en Membre

# demoteToMemberConfirm
source: Are you sure you want to demote "{familyName}" to Member? They will lose administrative privileges.
fr: Êtes-vous sûr de vouloir rétrograder "{familyName}" en Membre ? Ils perdront leurs privilèges d'administrateur.

source: Demote
fr: Rétrograder

# familyDemotedSuccess
source: Family demoted to Member successfully
fr: Famille rétrogradée en Membre avec succès

source: Failed to demote family
fr: Échec de la rétrogradation de la famille

source: Remove Family
fr: Retirer la Famille

# removeFamilyConfirm
source: Are you sure you want to remove "{familyName}" from the group? This action cannot be undone.
fr: Êtes-vous sûr de vouloir retirer "{familyName}" du groupe ? Cette action ne peut pas être annulée.

# removeFamilyAction
source: Remove
fr: Retirer

# familyRemovedSuccess
source: Family removed successfully
fr: Famille retirée avec succès

# failedToRemoveFamily
source: Failed to remove family: {error}
fr: Échec de la suppression de la famille : {error}

source: Remove from Group
fr: Retirer du Groupe

# cancelInvitationConfirm
source: Are you sure you want to cancel the invitation for "{familyName}"?
fr: Êtes-vous sûr de vouloir annuler l'invitation pour "{familyName}" ?

# invitationCanceledSuccess
source: Invitation canceled successfully
fr: Invitation annulée avec succès

# failedToCancelInvitation
source: Failed to cancel invitation: {error}
fr: Échec de l'annulation de l'invitation : {error}

source: No invitation ID found
fr: Aucun ID d'invitation trouvé

# anErrorOccurred
source: An error occurred: {error}
fr: Une erreur s'est produite : {error}

# roleOwner
source: OWNER
fr: PROPRIÉTAIRE

# roleMember
source: MEMBER
fr: MEMBRE

# rolePending
source: PENDING
fr: EN ATTENTE

# roleMemberDescription
source: Can view and join group trips
fr: Peut voir et rejoindre les trajets du groupe

# roleAdminDescription
source: Can manage group and invite members
fr: Peut gérer le groupe et inviter des membres

source: No admins
fr: Aucun administrateur

# adminCountMore
source: {firstName} (+{count} more)
fr: {firstName} (+{count} de plus)

source: Your Family
fr: Votre Famille

source: Invite Family
fr: Inviter une Famille

# inviteFamilyComingSoon
source: Invite family feature coming soon
fr: Fonctionnalité d'invitation de famille bientôt disponible

source: No families yet
fr: Aucune famille pour le moment

source: Invite families to get started
fr: Invitez des familles pour commencer

source: Loading families...
fr: Chargement des familles...

source: Failed to load families
fr: Échec du chargement des familles

source: Invite Family to Group
fr: Inviter une Famille au Groupe

# inviteFamilyToGroupSubtitle
source: Search and invite families to join this group
fr: Recherchez et invitez des familles à rejoindre ce groupe

source: Search Families
fr: Rechercher des Familles

source: Enter family name...
fr: Entrez le nom de la famille...

source: Invite as:
fr: Inviter en tant que :

source: Personal Message (Optional)
fr: Message Personnel (Optionnel)

source: Search Results
fr: Résultats de Recherche

# refineSearchForMoreResults
source: Showing maximum results. Refine your search to see more specific matches.
fr: Affichage du nombre maximum de résultats. Affinez votre recherche pour voir des correspondances plus spécifiques.

# andXMore
source: +{count} more
fr: +{count} de plus

# enterAtLeast2Characters
source: Enter at least 2 characters to search
fr: Entrez au moins 2 caractères pour rechercher

source: No families found
fr: Aucune famille trouvée

source: Already invited
fr: Déjà invitée

source: Inviting...
fr: Envoi en cours...

# searchFailed
source: Search failed: {error}
fr: Échec de la recherche : {error}

# invitationSent
source: Invitation sent to {familyName}
fr: Invitation envoyée à {familyName}

# invitationFailed
source: Invitation failed: {error}
fr: Échec de l'invitation : {error}

source: Manage Members
fr: Gérer les Membres

# manageMembersDescription
source: Manage family members, roles, and invitations for this group
fr: Gérez les familles membres, les rôles et les invitations pour ce groupe

source: Pending Invitation
fr: Invitation en attente

# cancelInvitationDescription
source: Revoke this pending invitation
fr: Révoquer cette invitation en attente

# promoteToAdminDescription
source: Grant admin permissions to this family
fr: Accorder les permissions admin à cette famille

# demoteToMemberDescription
source: Remove admin permissions from this family
fr: Retirer les permissions admin de cette famille

# removeFamilyFromGroupDescription
source: Remove this family from the group
fr: Retirer cette famille du groupe

# promoteToAdminConfirmation
source: Are you sure you want to promote {familyName} to group admin?
fr: Êtes-vous sûr de vouloir promouvoir {familyName} administrateur du groupe ?

# adminCanManageGroupMembers
source: Admins can manage group members and schedules
fr: Les admins peuvent gérer les membres et les plannings du groupe

# demoteToMemberConfirmation
source: Are you sure you want to demote {familyName} to member?
fr: Êtes-vous sûr de vouloir rétrograder {familyName} en membre ?

# demoteToMemberNote
source: This family will lose admin permissions
fr: Cette famille perdra ses permissions d'admin

# removeFamilyDialogAccessibilityLabel
source: Remove family from group
fr: Retirer la famille du groupe

# removeFamilyConfirmation
source: Are you sure you want to remove {familyName} from this group?
fr: Êtes-vous sûr de vouloir retirer {familyName} de ce groupe ?

# removeAdminFamilyNote
source: Warning: This admin family will be removed from the group
fr: Attention : Cette famille admin sera retirée du groupe

# invitedOn
source: Invited on {date}
fr: Invité le {date}

# cancelInvitationConfirmation
source: Are you sure you want to cancel the invitation for {familyName}?
fr: Êtes-vous sûr de vouloir annuler l'invitation de {familyName} ?

# cancelInvitationNote
source: The family will not be able to join with this invitation link
fr: La famille ne pourra pas rejoindre avec ce lien d'invitation

# familyAlreadyInvited
source: This family has already been invited to this group
fr: Cette famille a déjà été invitée à ce groupe

# familyAlreadyMember
source: This family is already a member of this group
fr: Cette famille est déjà membre de ce groupe

source: Family not found
fr: Famille introuvable

# invalidInvitationCode
source: Invalid or expired invitation code
fr: Code d'invitation invalide ou expiré

# insufficientPermissions
source: You don't have permission to perform this action
fr: Vous n'avez pas la permission d'effectuer cette action

# invalidRequest
source: Invalid request. Please check your input
fr: Requête invalide. Veuillez vérifier votre saisie

source: Authentication required
fr: Authentification requise

source: Resource not found
fr: Ressource introuvable

# conflictError
source: This action conflicts with existing data
fr: Cette action est en conflit avec des données existantes

# networkError
source: Network connection error. Please check your internet connection
fr: Erreur de connexion réseau. Veuillez vérifier votre connexion internet

# requestTimeout
source: Request timed out. Please try again
fr: La requête a expiré. Veuillez réessayer

# unexpectedError
source: An unexpected error occurred
fr: Une erreur inattendue s'est produite

source: Group Management
fr: Gestion des groupes

# invitationIsValid
source: This group invitation is valid and ready to use.
fr: Cette invitation de groupe est valide et prête à être utilisée.

source: Invited by:
fr: Invité par :

source: a group
fr: un groupe

# connectionFullyConnected
source: Fully Connected
fr: Entièrement connecté

# connectionLimitedConnectivity
source: Limited Connectivity
fr: Connectivité limitée

# connectionOffline
source: Offline
fr: Hors ligne

# connectionStatusTitle
source: Connection Status
fr: État de la connexion

# connectionHttpStatus
source: Internet Connection
fr: Connexion Internet

# connectionWebSocketStatus
source: Real-time Updates
fr: Mises à jour en temps réel

# connectionConnected
source: Connected
fr: Connecté

# connectionDisconnected
source: Disconnected
fr: Déconnecté

# snackbarBackOnline
source: Back online. Syncing...
fr: De retour en ligne. Synchronisation...

# snackbarLimitedConnectivity
source: Limited connectivity. Real-time updates may be delayed.
fr: Connectivité limitée. Les mises à jour en temps réel peuvent être retardées.

# snackbarOffline
source: You're offline. Changes will sync when reconnected.
fr: Vous êtes hors ligne. Les modifications seront synchronisées lors de la reconnexion.

source: Midday
fr: Midi

source: Evening
fr: Soir

source: Night
fr: Nuit

source: Unknown
fr: Inconnu

source: Currently Assigned
fr: Actuellement assignés

source: Available Vehicles
fr: Véhicules disponibles

source: No Vehicles Available
fr: Aucun véhicule disponible

# addVehiclesToFamily
source: Add vehicles to your family to assign them to schedules
fr: Ajoutez des véhicules à votre famille pour les assigner aux plannings

source: Error Loading Vehicles
fr: Erreur de chargement des véhicules

# vehiclesCount
source: {count, plural, =0{No vehicles} =1{1 vehicle} other{{count} vehicles}}
fr: {count, plural, =0{Aucun véhicule} =1{1 véhicule} other{{count} véhicules}}

source: Assigned
fr: Assignés

source: Assign Vehicle
fr: Assigner un véhicule

# availableCount
source: {count, plural, =0{None available} =1{1 available} other{{count} available}}
fr: {count, plural, =0{Aucun disponible} =1{1 disponible} other{{count} disponibles}}

# noVehiclesAssignedToTimeSlot
source: No vehicles assigned to this time slot
fr: Aucun véhicule assigné à ce créneau horaire

# allVehiclesAssigned
source: All available vehicles are assigned
fr: Tous les véhicules disponibles sont assignés

source: Expand {timeSlot}
fr: Déplier {timeSlot}

# seatsCount
source: {count, plural, =0{No seats} =1{1 seat} other{{count} seats}}
fr: {count, plural, =0{Aucune place} =1{1 place} other{{count} places}}

source: Seat Override
fr: Modification de capacité

# adjustCapacityForTrip
source: Adjust capacity for this trip
fr: Ajuster la capacité pour ce trajet

# temporarilyAdjustCapacity
source: Temporarily adjust vehicle capacity (e.g., wheelchair configuration)
fr: Ajustez temporairement la capacité du véhicule (ex: configuration fauteuil roulant)

# leaveEmptyForDefault
source: Leave empty for default ({capacity, plural, =0{no seats} =1{1 seat} other{{capacity} seats}})
fr: Laisser vide pour la valeur par défaut ({capacity, plural, =0{aucune place} =1{1 place} other{{capacity} places}})

# overrideMustBeBetween
source: Override must be between 0 and 50 seats
fr: La modification doit être entre 0 et 50 places

# cannotDetermineWeek
source: Cannot determine week for schedule
fr: Impossible de déterminer la semaine pour le planning

source: Seat override updated
fr: Modification de capacité mise à jour

source: Seat override active
fr: Modification de capacité active

# overrideDetails
source: Override: {override} ({base} base)
fr: Personnalisé: {override} ({base} de base)

source: Schedule configuration required
fr: Configuration du planning requise

# setupTimeSlotsToEnableScheduling
source: This group needs schedule configuration. Set up time slots to enable scheduling.
fr: Ce groupe nécessite une configuration du planning. Configurez les créneaux horaires pour activer la planification.

# contactAdministratorToSetupTimeSlots
source: Contact a group administrator to set up time slots.
fr: Contactez un administrateur du groupe pour configurer les créneaux horaires.

source: Navigate to previous week
fr: Naviguer vers la semaine précédente

source: Navigate to next week
fr: Naviguer vers la semaine suivante

# emptySlotTapToAddVehicle
source: Empty slot for {day} at {time}, tap to add vehicle
fr: Créneau vide pour {day} à {time}, appuyez pour ajouter un véhicule

# slotWithVehiclesTapToManage
source: {day} at {time} with {count, plural, =1{1 vehicle} other{{count} vehicles}}, tap to manage
fr: {day} à {time} avec {count, plural, =1{1 véhicule} other{{count} véhicules}}, appuyez pour gérer

# removeVehicleFromSlot
source: Remove {vehicleName} from this slot
fr: Retirer {vehicleName} de ce créneau

# assignChildToVehicle
source: Assign {childName} to vehicle
fr: Assigner {childName} au véhicule

# removeChildFromVehicle
source: Remove {childName} from vehicle
fr: Retirer {childName} du véhicule

# hasPendingChanges
source: Has pending offline changes
fr: Des modifications hors ligne sont en attente
