Repository: jrevillard/edulift-mobile
Catalog: lib/l10n/app_*.arb
Languages: fr

# errorChildAgeNotNumber
source: Child age must be a number
fr: L'âge de l'enfant doit être un nombre

# errorChildAgeRequired
source: Child age is required
fr: L'âge de l'enfant est requis

# errorChildAgeTooOld
source: Child age cannot exceed {maxAge} years
fr: L'âge de l'enfant ne peut pas dépasser {maxAge} ans

# errorChildAgeTooYoung
source: Child age must be at least {minAge} year(s) old
fr: L'âge de l'enfant doit être d'au moins {minAge} an(s)

# errorChildEmergencyContactInvalid
source: Emergency contact format is invalid (phone or email required)
fr: Le format du contact d'urgence est invalide (téléphone ou e-mail requis)

# errorChildEmergencyContactRequired
source: Emergency contact is required
fr: Le contact d'urgence est requis

# errorChildGradeInvalid
source: Grade format is invalid
fr: Le format du niveau scolaire est invalide

# errorChildMedicalInfoTooLong
source: Medical information is too long (maximum {maxLength} characters)
fr: Les informations médicales sont trop longues (maximum {maxLength} caractères)

# errorChildNameInvalidChars
source: Child name contains invalid characters
fr: Le nom de l'enfant contient des caractères non valides

# errorChildNameMaxLength
source: Child name cannot exceed 30 characters
fr: Le nom de l'enfant ne peut pas dépasser 30 caractères

# errorChildNameMinLength
source: Child name must be at least 2 characters
fr: Le nom de l'enfant doit contenir au moins 2 caractères

# errorChildNameRequired
source: Child name is required
fr: Le nom de l'enfant est requis

# errorChildSchoolNameTooLong
source: School name is too long (maximum {maxLength} characters)
fr: Le nom de l'école est trop long (maximum {maxLength} caractères)

# errorChildSpecialNeedsTooLong
source: Special needs information is too long (maximum {maxLength} characters)
fr: Les informations sur les besoins spéciaux sont trop longues (maximum {maxLength} caractères)

# errorConflictMessage
source: Your data conflicts with recent changes. Please refresh and try again.
fr: Vos données entrent en conflit avec des modifications récentes. Veuillez actualiser et réessayer.

# errorConflictTitle
source: Data Conflict
fr: Conflit de Données

# errorEmailAlreadyExists
source: This email address is already registered
fr: Cette adresse e-mail est déjà enregistrée

# errorEmailInvalid
source: Please enter a valid email address
fr: Veuillez saisir une adresse e-mail valide

# errorEmailRequired
source: Email address is required
fr: L'adresse e-mail est requise

# errorFailedToExportLogs
source: Failed to export logs: {error}
fr: Échec d'export des logs : {error}

# errorFailedToLeaveFamily
source: Failed to leave family: {error}
fr: Échec de quitter la famille : {error}

# errorFailedToRemoveMember
source: Failed to remove member: {error}
fr: Échec du retrait du membre : {error}

# errorFailedToUpdateRole
source: Failed to update role: {error}
fr: Échec de mise à jour du rôle : {error}

# errorFamilyNameInvalidChars
source: Family name contains invalid characters
fr: Le nom de famille contient des caractères non valides

# errorFamilyNameMaxLength
source: Family name cannot exceed 50 characters
fr: Le nom de famille ne peut pas dépasser 50 caractères

# errorFamilyNameMinLength
source: Family name must be at least 2 characters
fr: Le nom de famille doit contenir au moins 2 caractères

# errorFamilyNameRequired
source: Family name is required
fr: Le nom de famille est requis

# errorInsufficientPermissions
source: You don't have permission to perform this action
fr: Vous n'avez pas la permission d'effectuer cette action

# errorInvalidData
source: Invalid data provided. Please check your information and try again.
fr: Données invalides fournies. Veuillez vérifier vos informations et réessayer.

# errorInvitationCancelled
source: This invitation has been cancelled
fr: Cette invitation a été annulée

# errorInvitationCodeInvalid
source: Please enter a valid invitation code
fr: Veuillez saisir un code d'invitation valide

# errorInvitationCodeRequired
source: Invitation code is required
fr: Le code d'invitation est requis

# errorInvitationEmailMismatch
source: This invitation was sent to a different email address. Please use the email address the invitation was sent to.
fr: Cette invitation a été envoyée à une adresse email différente. Veuillez utiliser l'adresse email à laquelle l'invitation a été envoyée.

# errorInvitationExpired
source: This invitation has expired
fr: Cette invitation a expiré

# errorInvitationNotFound
source: Invitation not found or has been revoked
fr: Invitation introuvable ou révoquée

source: Error loading data
fr: Erreur lors du chargement des données

source: Error loading log level
fr: Erreur lors du chargement du niveau de log

# errorMemberAlreadyExists
source: This member is already part of the family
fr: Ce membre fait déjà partie de la famille

# errorMemberNotFound
source: Member not found
fr: Membre non trouvé

# errorMessageTooLong
source: {count, plural, =1{Message cannot exceed 1 character} other{Message cannot exceed {count} characters}}
fr: {count, plural, =1{Le message ne peut pas dépasser 1 caractère} other{Le message ne peut pas dépasser {count} caractères}}

# errorNetwork
source: Network error occurred
fr: Erreur réseau survenue

# errorNetworkGeneral
source: Connection error. Check your internet connection.
fr: Erreur de connexion. Vérifiez votre connexion internet.

# errorNetworkMessage
source: Please check your internet connection and try again.
fr: Veuillez vérifier votre connexion internet et réessayer.

# errorNetworkTitle
source: Connection Problem
fr: Problème de Connexion

# errorOfflineMessage
source: This feature is not available while offline. Please connect to the internet.
fr: Cette fonctionnalité n'est pas disponible en mode hors ligne. Veuillez vous connecter à internet.

# errorOfflineTitle
source: Offline Mode
fr: Mode Hors Ligne

# errorPageTitle
source: Error
fr: Erreur

# errorPendingInvitationExists
source: An invitation to this email address is already pending
fr: Une invitation à cette adresse email est déjà en attente

# errorPermissionMessage
source: This app needs permission to continue. Please grant the required permission.
fr: Cette application a besoin d'une permission pour continuer. Veuillez accorder la permission requise.

# errorPermissionTitle
source: Permission Required
fr: Permission Requise

source: Error processing request
fr: Erreur lors du traitement de la demande

# errorRoleInvalid
source: Please select a valid role
fr: Veuillez sélectionner un rôle valide

# errorRoleRequired
source: Role selection is required
fr: La sélection d'un rôle est requise

# errorServerGeneral
source: Server error. Please try again later.
fr: Erreur serveur. Veuillez réessayer plus tard.

# errorServerMessage
source: The server is currently experiencing issues. Please try again later.
fr: Le serveur rencontre actuellement des difficultés. Veuillez réessayer plus tard.

# errorServerTitle
source: Server Error
fr: Erreur Serveur

# errorStorageMessage
source: There was a problem saving your data. Please try again.
fr: Un problème est survenu lors de la sauvegarde de vos données. Veuillez réessayer.

# errorStorageTitle
source: Storage Problem
fr: Problème de Stockage

# errorSyncMessage
source: Unable to sync your data. Your changes will be saved when connection is restored.
fr: Impossible de synchroniser vos données. Vos modifications seront sauvegardées lors de la restauration de la connexion.

# errorSyncTitle
source: Sync Failed
fr: Échec de Synchronisation

# errorSystemMessage
source: An unexpected system error occurred. Please try again.
fr: Une erreur système inattendue s'est produite. Veuillez réessayer.

# errorSystemTitle
source: System Error
fr: Erreur Système

# errorTitle
source: Error
fr: Erreur

# errorUnexpected
source: An error occurred.
fr: Une erreur est survenue.

# errorUnexpectedMessage
source: Something went wrong. Please try again or contact support if the problem continues.
fr: Une erreur s'est produite. Veuillez réessayer ou contacter le support si le problème persiste.

# errorUnexpectedTitle
source: Unexpected Error
fr: Erreur Inattendue

# errorUnknown
source: An unknown error occurred
fr: Une erreur inconnue s'est produite

# errorValidation
source: Validation error
fr: Erreur de validation

# errorValidationMessage
source: Please check the information you entered and try again.
fr: Veuillez vérifier les informations saisies et réessayer.

# errorValidationTitle
source: Invalid Information
fr: Informations Invalides

# errorVehicleCapacityNotNumber
source: Vehicle capacity must be a number
fr: La capacité du véhicule doit être un nombre

# errorVehicleCapacityRequired
source: Vehicle capacity is required
fr: La capacité du véhicule est requise

# errorVehicleCapacityTooHigh
source: Vehicle capacity cannot exceed 10
fr: La capacité du véhicule ne peut pas dépasser 10

# errorVehicleCapacityTooLow
source: Vehicle capacity must be at least 1
fr: La capacité du véhicule doit être d'au moins 1

# errorVehicleDescriptionTooLong
source: Vehicle description is too long
fr: La description du véhicule est trop longue

# errorVehicleNameInvalidChars
source: Vehicle name contains invalid characters
fr: Le nom du véhicule contient des caractères non valides

# errorVehicleNameMaxLength
source: Vehicle name cannot exceed 50 characters
fr: Le nom du véhicule ne peut pas dépasser 50 caractères

# errorVehicleNameMinLength
source: Vehicle name must be at least 2 characters
fr: Le nom du véhicule doit contenir au moins 2 caractères

# errorVehicleNameRequired
source: Vehicle name is required
fr: Le nom du véhicule est requis

# estimatedLogSize
source: Estimated log size: {sizeMB}MB
fr: Taille estimée des logs: {sizeMB}MB

source: Event
fr: Événement

source: Expired
fr: Expiré

# expiredLabel
source: Expired
fr: Expirée

# expires
source: Expires: {date}
fr: Expire : {date}

source: Expires At (Optional)
fr: Expire le (Optionnel)

# expiresIn
source: {days, plural, =0{Expires today} =1{Expires tomorrow} other{Expires in {days} days}}
fr: {days, plural, =0{Expire aujourd'hui} =1{Expire demain} other{Expire dans {days} jours}}

# expiresInDays
source: Expires in {days} days
fr: Expire dans {days} jours

# expiresInDaysHours
source: Expires in {days} days and {hours} hours
fr: Expire dans {days} jours et {hours} heures

# dayLabel
source: Day
fr: Jour

# expiresInHours
source: Expires in {hours} hours
fr: Expire dans {hours} heures

# expiresInHoursMinutes
source: Expires in {hours} hours and {minutes} minutes
fr: Expire dans {hours} heures et {minutes} minutes

# expiresInMinutes
source: Expires in {minutes} minutes
fr: Expire dans {minutes} minutes

# expiresOn
source: Expires: {date}
fr: Expire : {date}

source: Expiring in 3 Days
fr: Expirent dans 3 jours

source: Expiring Soon
fr: Expire bientôt

source: Expiring This Week
fr: Expirent cette semaine

# expiringVeryShortly
source: Expiring Very Soon
fr: Expirent très bientôt

# exportIncludesComprehensive
source: Export includes comprehensive diagnostic information for support
fr: L'export inclut des informations de diagnostic complètes pour le support

# exportIncludesInfo
source: Export includes app version, device info, recent logs, and diagnostic data
fr: L'export inclut la version de l'app, les infos de l'appareil, les logs récents et les données de diagnostic

source: Export Logs for Support
fr: Exporter les logs pour le support

source: Exporting...
fr: Exportation en cours...

source: Extend
fr: Prolonger

source: Extended
fr: Étendu

source: Failed
fr: Échouées

# failedToAssignChildren
source: Failed to assign children: {error}
fr: Échec de l'assignation des enfants : {error}

# failedToCancel
source: Failed to cancel: {error}
fr: Échec de l'annulation : {error}

# failedToCopyCode
source: Failed to copy code: {error}
fr: Échec de la copie du code : {error}

# failedToExportLogs
source: Failed to export logs: {error}
fr: Échec de l'exportation des logs: {error}

# failedToLeaveFamily
source: Failed to leave family: {error}
fr: Échec de quitter la famille : {error}

source: Failed to load groups
fr: Échec du chargement des groupes

source: Failed to Load Schedule
fr: Impossible de charger le planning

source: Failed to change week
fr: Impossible de changer de semaine

# failedToLoadVehicles
source: Failed to load vehicles: {error}
fr: Impossible de charger les véhicules : {error}

# failedToRemoveMember
source: Failed to remove member: {error}
fr: Échec de suppression du membre : {error}

source: Failed to send invitation
fr: Échec de l'envoi de l'invitation

# failedToUpdateRole
source: Failed to update role: {error}
fr: Échec de mise à jour du rôle : {error}

source: Family
fr: Famille

# familyConflictTitle
source: Family Conflict
fr: Conflit familial

# familyCount
source: {count, plural, =1{{count} family} other{{count} families}}
fr: {count, plural, =1{{count} famille} other{{count} familles}}

source: Family invitation
fr: Invitation famille

source: Family Invitations
fr: Invitations Familiales

source: Family Member
fr: Membre de famille

source: Family Member Actions
fr: Actions des Membres de Famille

# familyMemberDescription
source: Regular family member with basic access
fr: Membre de famille ordinaire avec accès de base

source: Family Members
fr: Membres de la Famille

# familyMembersCount
source: {count, plural, =0{Family Members} =1{Family Members ({count})} other{Family Members ({count})}}
fr: {count, plural, =0{Membres de la Famille} =1{Membres de la Famille ({count})} other{Membres de la Famille ({count})}}

# currentUserLabel
source: , current user
fr: , utilisateur actuel

# youLabel
source: (You)
fr: (Vous)

# weeksAgo
source: {count, plural, =1{{count} week ago} other{{count} weeks ago}}
fr: {count, plural, =1{Il y a {count} semaine} other{Il y a {count} semaines}}

# monthsAgo
source: {count, plural, =1{{count} month ago} other{{count} months ago}}
fr: {count, plural, =1{Il y a {count} mois} other{Il y a {count} mois}}

# yearsAgo
source: {count, plural, =1{{count} year ago} other{{count} years ago}}
fr: {count, plural, =1{Il y a {count} an} other{Il y a {count} ans}}

source: Remove Admin Role
fr: Retirer le rôle d'administrateur

source: Change to regular member
fr: Changer en membre régulier

source: Grant admin permissions
fr: Accorder les permissions d'administrateur

source: Admin permissions include:
fr: Les permissions d'administrateur incluent :

# adminPermissionManageMembers
source: Manage family members
fr: • Gérer les membres de la famille

# adminPermissionSendInvitations
source: Send invitations
fr: • Envoyer des invitations

# adminPermissionManageVehiclesChildren
source: Manage vehicles and children
fr: • Gérer les véhicules et les enfants

# adminPermissionConfigureSettings
source: Configure family settings
fr: • Configurer les paramètres de la famille

# familyNameRequired
source: Family name is required
fr: Le nom de famille est requis

# familyNameTooLong
source: Family name must be less than 50 characters
fr: Le nom de famille doit contenir moins de 50 caractères

# familyNameTooShort
source: Family name must be at least 2 characters
fr: Le nom de famille doit contenir au moins 2 caractères

# fieldRequired
source: This field is required
fr: Ce champ est obligatoire

source: Filter
fr: Filtrer

# filterAll
source: All
fr: Tout

# filterExpired
source: Expired
fr: Expiré

# filterExpiringSoon
source: Expiring Soon
fr: Expire bientôt

source: Filter Options
fr: Options de filtre

# filterPending
source: Pending
fr: En attente

source: First name *
fr: Prénom *

# firstNameRequired
source: First name is required
fr: Le prénom est obligatoire

source: French
fr: Français

source: Fri
fr: Ven

source: Friday
fr: Vendredi

# fridayShort
source: Fri
fr: Ven

source: Full name
fr: Nom complet

source: Generate
fr: Générer

source: Generate codes
fr: Générer des codes

# generateCodesTooltip
source: Generate codes
fr: Générer des codes

source: Generate new code
fr: Générer un nouveau code

source: Give up admin privileges
fr: • Abandonner les privilèges d'administrateur

source: Go Back
fr: Retour

# goBackButton
source: Go Back
fr: Retour

source: Go to Groups
fr: Aller aux groupes

# gotItButton
source: Got it
fr: Compris

source: Grant Admin Role
fr: Accorder le Rôle d'Admin

# groupCreated
source: Group created successfully
fr: Groupe créé avec succès

source: Group created successfully\!
fr: Groupe créé avec succès \!

# groupCreatorInfo
source: As the creator, you'll be the group administrator and can invite other families.
fr: En tant que créateur, vous serez l'administrateur du groupe et pourrez inviter d'autres familles.

source: Group Description
fr: Description du Groupe

# groupDescriptionMaxLength
source: Description cannot exceed 500 characters
fr: La description ne peut pas dépasser 500 caractères

source: Group Details
fr: Détails du Groupe

source: Group invitation
fr: Invitation groupe

source: Group Invitations
fr: Invitations de groupe

# groupJoined
source: Joined group successfully
fr: Groupe rejoint avec succès

source: Group Name
fr: Nom du Groupe

# groupNameMaxLength
source: Group name must be less than 50 characters
fr: Le nom du groupe doit contenir moins de 50 caractères

# groupNameMinLength
source: Group name must be at least 3 characters
fr: Le nom du groupe doit contenir au moins 3 caractères

# groupNameRequired
source: Group name is required
fr: Le nom du groupe est requis

source: Group Not Found
fr: Groupe non trouvé

# groupNotFoundMessage
source: The selected group could not be found or you no longer have access to it.
fr: Le groupe sélectionné n'a pas pu être trouvé ou vous n'y avez plus accès.

# groups
source: Groups: {count}
fr: Groupes : {count}

# groupsLabel
source: Groups
fr: Groupes

source: Help
fr: Aide

# helperTextDefaultSeats
source: Default: {count} {count, plural, =1{seat} other{seats}}
fr: Par défaut : {count} {count, plural, =0{siège} =1{siège} other{sièges}}

source: Hide Vehicles
fr: Masquer les véhicules

# highExpiringCount
source: {count, plural, =1{{count} expiring within 24 hours} other{{count} expiring within 24 hours}}
fr: {count, plural, =1{{count} expire dans les 24 heures} other{{count} expirent dans les 24 heures}}

# hoursAgo
source: {count, plural, =1{{count} hour ago} other{{count} hours ago}}
fr: {count, plural, =1{Il y a {count} heure} other{Il y a {count} heures}}

source: Implementation coming soon
fr: Implémentation à venir

# incorrectConfirmation
source: Confirmation text does not match
fr: Le texte de confirmation ne correspond pas

# instructionStep1
source: 1. Open your email app
fr: 1. Ouvrez votre application email

# instructionStep2
source: 2. Look for the EduLift email
fr: 2. Recherchez l'email d'EduLift

# instructionStep3
source: 3. Click the login link
fr: 3. Cliquez sur le lien de connexion

# instructionStep4
source: 4. You will be automatically logged in
fr: 4. Vous serez automatiquement connecté

source: Invalid
fr: Invalides

# invalidCapacityRange
source: Please enter a valid capacity between 1 and 50
fr: Veuillez entrer une capacité valide entre 1 et 50

# invalidEmail
source: Invalid email address
fr: Adresse email invalide

# invalidEmailFormat
source: Please enter a valid email address
fr: Veuillez entrer une adresse email valide

# invalidDeepLinkTitle
source: Invalid Link
fr: Lien invalide

# invalidDeepLinkMessage
source: The link you followed is not valid or has expired. Please check the link and try again.
fr: Le lien que vous avez suivi n'est pas valide ou a expiré. Veuillez vérifier le lien et réessayer.

# invalidInvitationTitle
source: Invalid Invitation
fr: Invitation invalide

# invalidTimeFormat
source: Invalid time format. Use HH:MM (24-hour)
fr: Format d'heure invalide. Utilisez HH:MM (24h)

source: Invitation Actions
fr: Actions d'Invitation

# invitationActionsTooltip
source: Invitation actions for {email}
fr: Actions d'invitation pour {email}

source: Invitation Analytics
fr: Analytiques des Invitations

# invitationCancelledFor
source: Invitation cancelled for {email}
fr: Invitation annulée pour {email}

source: Invitation cancelled successfully
fr: Invitation annulée avec succès

source: Invitation Code
fr: Code d'Invitation

# invitationCodeCopied
source: Invitation code copied to clipboard
fr: Code d'invitation copié dans le presse-papiers

source: Invitation code not available
fr: Code d'invitation non disponible

# invitationCodeRequired
source: Invitation code is required
fr: Le code d'invitation est requis

# invitationExpired
source: This invitation has expired
fr: Cette invitation a expiré

# invitationExpiredDesc
source: This invitation has expired and is no longer valid
fr: Cette invitation a expiré et n'est plus valide

# invitationSentTo
source: Invitation sent to {email}
fr: Invitation envoyée à {email}

source: Invitation statistics
fr: Statistiques des invitations

source: Invitation Type
fr: Type d'invitation

# invitationsExpiring
source: {count} invitations expiring soon
fr: {count} invitations expirent bientôt

source: Invite
fr: Inviter

source: Invite Family Member
fr: Inviter un membre de famille

# inviteFamilyMembers
source: Invite to family
fr: Inviter dans la famille

# inviteMembersToStart
source: Invite members to get started
fr: Invitez des membres pour commencer

source: Invite New Member
fr: Inviter un Nouveau Membre

source: Invite to group
fr: Inviter dans un groupe

# invitedToFamily
source: Invited to join: {familyName}
fr: Invité à rejoindre : {familyName}

source: Join
fr: Rejoindre

# joinFamily
source: Join {familyName}
fr: Rejoindre {familyName}

source: Join {familyName}
fr: Rejoindre {familyName}

source: Join Group
fr: Rejoindre un Groupe

source: Join {groupName}
fr: Rejoindre {groupName}

source: Join with code
fr: Rejoindre avec un code

source: Joined
fr: Rejoint

source: Joining in progress...
fr: Adhésion en cours...

source: just now
fr: à l'instant

source: Keep Invitation
fr: Garder l'invitation

# labelFieldLabel
source: Label
fr: Libellé

# labelHint
source: School Drop-off
fr: Dépôt école

# labelRequired
source: Label cannot be empty
fr: Le libellé ne peut pas être vide

# labelTooLong
source: Label must be 50 characters or less
fr: Le libellé doit faire 50 caractères maximum

source: Language
fr: Langue

# languageChanged
source: Language changed successfully
fr: Langue changée avec succès

source: Last Admin Protection
fr: Protection dernier admin

# lastAdminWarning
source: You are the last admin of this family. You must assign a new admin or transfer ownership before leaving.
fr: Vous êtes le dernier admin de cette famille. Vous devez assigner un nouvel admin ou transférer la propriété avant de partir.

# lastExported
source: Last exported: {timeAgo}
fr: Dernière exportation: {timeAgo}

source: Last name *
fr: Nom de famille *

source: Last Updated
fr: Dernière mise à jour

source: Leave
fr: Partir

# leaveButton
source: Leave
fr: Quitter

# typeNameToConfirm
source: To confirm, type the name exactly: {name}
fr: Pour confirmer, tapez le nom exactement : {name}

source: Please type "{name}" exactly
fr: Veuillez taper "{name}" exactement

source: Leave Family
fr: Quitter la famille

# leaveFamilyAndJoinFamilyName
source: Leave current family and join {familyName}
fr: Quitter la famille actuelle et rejoindre {familyName}

# leaveFamilyConfirmation
source: Are you sure you want to leave this family?
fr: Êtes-vous sûr de vouloir quitter cette famille ?

# leaveFamilyTitle
source: Leave Family
fr: Quitter la Famille

source: Warning
fr: Avertissement

# leaveFamilyWarningMessage
source: You will lose access to all family data, schedules, and vehicles. This action cannot be undone.
fr: Vous perdrez l'accès à toutes les données familiales, horaires et véhicules. Cette action est irréversible.
